Repository: 84000/data-translation-memory
Catalog: toh79-v3.tmx
Source language: bo
Languages: en

source: སྡིག་པ་མི་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་སྤང་བའི་ཕྱིར་འདུན་པ་སྐྱེད་ཅིང་འབད་ལ་བརྩོན་འགྲུས་རྩོམ་ཞིང་སེམས་རབ་ཏུ་འཛིན་ཏེ་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་།
en: And so as to rid oneself of all wrong and unvirtuous phenomena that have already arisen, one maintains an attitude that is fully attentive, with resolve, exertion, and perseverance.

source: ཆོས་ཐམས་ཅད་ལ་སྟོང་པ་ཉིད་དུ་ཡང་མོས་ལ་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པའི་ཕྱིར་འདུན་པ་སྐྱེད་ཅིང་འབད་ལ་བརྩོན་འགྲུས་རྩོམ་ཞིང་སེམས་རབ་ཏུ་འཛིན་ཏེ་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་། ཆོས་ཐམས་ཅད་རྣམ་པར་གྲོལ་བར་ཡང་ཡིད་ཆེས་ལ། དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་གནས་པར་བྱ་བ་དང་།
en: “(3) Though one has conviction that all phenomena are empty, nevertheless, so as to give rise to virtuous phenomena that have not yet arisen, one maintains an attitude that is fully attentive, with resolve, exertion, and perseverance.

source: ཉམས་པར་མི་འགྱུར་བར་བྱ་བ་དང་། ཕྱིར་ཞིང་འཕེལ་བར་བྱ་བའི་ཕྱིར་འདུན་པ་སྐྱེད་ཅིང་འབད་ལ་བརྩོན་འགྲུས་རྩོམ་ཞིང་སེམས་རབ་ཏུ་འཛིན་ཏེ་ཡང་དག་པར་རབ་ཏུ་འཇོག་ལ་ཆོས་ཐམས་ཅད་ལ་རྩོམ་པ་མེད་ཅིང་རྟུལ་བ་མེད་པར་ཡང་མཐོང་སྟེ།
en: “(4) Though one believes that all phenomena are liberated, nevertheless, so as to ensure that those virtuous qualities that have already arisen will remain and not diminish, but grow, one maintains an attitude that is fully attentive, with resolve, exertion, and perseverance.

source: ཡང་མཉམ་པ་ཉིད་གང་ཡིན་པ་དེ་ལ་ཆོས་གང་གི་སྐྱེ་བ་ཡང་མེད།
en: And seeing that all phenomena neither begin nor end, one realizes that in the sameness of all phenomena there is neither arising nor ceasing.

source: འགོག་པ་ཡང་མེད་པ་འདི་ནི་ཡང་དག་པའི་སྤོང་བ་བསྒོམ་པའོ། །
en: This is cultivation of the exertions.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “They perfect cultivation of the four bases of magical power.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བསྒོམ་པ་གང་ཞེ་ན།
en: What is it to meditatively cultivate the bases of magical power?

source: གང་ལུས་དང་སེམས་ལས་སུ་རུང་བ་སྟེ།
en: One first develops mental and physical pliancy.

source: དེ་སེམས་ལས་སུ་རུང་བས་དགེ་བའི་ཆོས་ལ་འདུན་པ་ཡང་མི་འདོར་ལ་འདོད་པའི་འདོད་ཆགས་སྤང་བའི་ཕྱིར་ཡང་མངོན་པར་བརྩོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་ཀྱང་རྩོམ་ལ།
en: With mental pliancy, one does not give up the resolve toward virtuous qualities, one strives to abandon desire, and one makes an effort to bring sentient beings to full ripening.

source: བརྟགས་ནས་ཀྱང་ཆོས་ཐམས་ཅད་མི་དམིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱང་མི་འདོར་ལ་སེམས་སྒྱུ་མ་ལྟ་བུར་ཡང་རབ་ཏུ་ཤེས་པ་དང་།
en: Though on analysis all phenomena are without referents, in order to fully and completely awaken all the qualities of a buddha, one does not give up the mind of awakening, while recognizing that the mind is like an illusion.

source: ཇི་ལྟར་ཐོས་པའི་ཆོས་ལ་ཚུལ་བཞིན་དུ་ཡང་དཔྱོད་ལ་ཆོས་རྣམས་ལ་གནས་པར་ཡང་མི་བྱེད་ཅིང་མངོན་པར་ཞེན་པ་ཡང་མེད་པའོ། །
en: Analyzing things in accordance with the Dharma as it has been heard, one does not settle on or cling to phenomena.

source: དེ་དབང་པོ་ལྔ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ། དབང་པོ་དྲུག་ལ་རྟེན་པར་མི་བྱེད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཤེས་པ་ཡང་གཏོང་ལ།
en: “They perfect cultivation of the five faculties, they do not rely on the six senses, and they relinquish even knowledge for the sake of bringing the faculties of sentient beings to full ripening.

source: གཅིག་ཏུ་གནས་པ་ཡང་ཐོབ་པར་འགྱུར་ཞིང་གཞན་གྱི་དད་པས་ཀྱང་མི་འགྲོ་བ་དང་།
en: (1) They achieve one-pointed concentration and live without putting faith in others.

source: ཐམས་ཅད་ཀྱང་ཡོངས་སུ་ཐོབ་ལ། བླང་བ་ཡང་མེད་ཅིང་དོར་བ་ཡང་མེད་པ་དང་།
en: (2) They achieve everything without either accepting or rejecting.

source: ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ལ་ཡང་རྨོངས་པ་མེད་ལ། དྲན་པ་ཡང་མེད་ཅིང་ཡིད་ལ་བྱེད་པ་ཡང་མེད་པ་དང་།
en: (3) They know without confusion the paths that lead to all states, without needing to recollect or think of them.

source: ཆོས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཡང་སོང་ལ། རྟག་ཏུ་མཉམ་པར་ཡང་གཞག་པར་གྱུར་ཅིང་ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: (4) They observe all phenomena, and by maintaining equanimity toward them, enter meditative equipoise in the sameness of all phenomena.

source: རབ་རིབ་མེད་པའི་ཡེ་ཤེས་ཀྱི་སྣང་བ་ཡང་ཐོབ་པར་གྱུར་ལ།
en: (5) They reach the light of undarkened gnosis, and completely sever elaborations and views.

source: སྤྲོས་པ་དང་ལྟ་བ་ཡང་ཡང་དག་པར་ཆད་པ་འདི་ནི་དེའི་དབང་པོ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པའོ། །
en: In this way they perfect meditation on the faculties.

source: དེ་སྟོབས་ལྔ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ། དད་པའི་སྟོབས་དང་ལྡན་པས་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་རྫི་བ་དང་།
en: “They perfect cultivation of the five powers: (1) With the power of faith, they are unassailable by all opponents.

source: བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཀྱིས་བདུད་ཐམས་ཅད་ཀྱིས་ཐུབ་པར་དཀའ་བ་དང་།
en: (2) With the power of effort, they are inaccessible to all māras.

source: དྲན་པའི་སྟོབས་ཀྱིས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ཐམས་ཅད་དུ་མི་འཕྲོགས་པ་དང་།
en: (3) With the power of mindfulness, they are not captivated by śrāvakas or pratyekabuddhas.

source: ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀྱིས་སྒྲིབ་པ་རྣམས་ཀྱིས་མི་ནོན་པ་དང་།
en: (4) With the power of meditative absorption, they are not weighed down by impediments.

source: ཤེས་རབ་ཀྱི་སྟོབས་དང་ལྡན་པས་ལྟ་བར་གྱུར་པ་རྣམས་ཀྱིས་མངོན་པར་ཞེན་པ་མེད་པ་སྟེ།
en: (5) With the power of wisdom, they have no attachment to views.

source: དེ་ལྟར་སྟོབས་ལྔ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: In this way they perfect cultivation of the five powers.

source: དེ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “They perfect cultivation of the seven branches of awakening.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒོམ་པ་གང་ཞེ་ན།
en: What is it to meditatively cultivate the branches of awakening?

source: འདི་ལྟ་སྟེ། དགེ་བའི་ཆོས་ཐམས་ཅད་མི་བརྗེད་པར་བྱ་བའི་ཕྱིར་དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒོམ་པ་དང་།
en: It is like this: (1) So as not to forget all virtuous phenomena, they cultivate the branch of awakening that perfects mindfulness.

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་འཐུན་པར་བྱ་བའི་ཕྱིར་ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒོམ་པ་དང་།
en: (2) So as to behave in accordance with dependent origination, they cultivate the branch of awakening that perfects discrimination.

source: བྱང་ཆུབ་ཀྱི་ལམ་ལས་ཕྱིར་མི་ལྡོག་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒོམ་པ་དང་།
en: (3) So as to never turn back from the path to awakening, they cultivate the branch of awakening that perfects effort.

source: ཟང་ཟིང་མེད་པའི་ཆོས་ལ་དགའ་བ་རབ་ཏུ་མྱང་བར་བྱ་བའི་ཕྱིར་དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒོམ་པ་དང་།
en: (4) So as to experience the joy of unadulterated phenomena, they cultivate the branch of awakening that perfects joy.

source: ལུས་དང་སེམས་ཀྱི་གཡོ་བ་དང་བྲལ་བའི་ཕྱིར་ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒོམ་པ་དང་།
en: (5) So as to quell mental and physical agitation, they cultivate the branch of awakening that perfects pliancy.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་མངོན་པར་བསྒྲུབས་པའི་ཕྱིར་ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒོམ་པ་དང་།
en: (6) So as to actualize emptiness, signlessness, and wishlessness, they cultivate the branch of awakening that perfects meditative absorption.

source: མཐོ་དམའ་མེད་པའི་བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒོམ་པ་སྟེ།
en: And (7) so as to be without highs and lows, they cultivate the branch of awakening that perfects equanimity.

source: འདི་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒོམ་པ་ཞེས་བྱའོ། །
en: This is what is called cultivating the branches of awakening.

source: གྲོགས་པོ་དག་བག་ཡོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཚེགས་ཆུང་ངུས་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ། ལམ་བསྒོམ་པ་གང་ཞེ་ན། གང་འདི་རྟག་པ་དང་ཆད་པ་དང་བྲལ་བའི་ཡང་དག་པའི་ལྟ་བ་བསྒོམ་པ་དང་། འདོད་པ་དང་གནོད་སེམས་དང་རྣམ་པར་འཚེ་བའི་རྣམ་པར་རྟོག་པ་དང་བྲལ་བའི་ཡང་དག་པའི་རྟོག་པ་བསྒོམ་པ་དང་། བདག་དང་གཞན་ལ་གདུང་བ་མེད་པའི་ཡང་དག་པའི་ངག་བསྒོམ་པ་དང་།
en: “Friends, heedful bodhisattvas perfect cultivation of the noble eightfold path with little difficulty.

source: ཚུལ་འཆོས་པ་དང་། ཁ་གསག་དང་། གཞོགས་སློང་དང་།
en: What is it to cultivate the path?

source: ཐོབ་ཀྱིས་འཇལ་བ་དང་བྲལ་བའི་ཡང་དག་པའི་འཚོ་བ་བསྒོམ་པ་དང་། ལུས་དང་སེམས་ཉམ་ཆུང་བ་དང་བྲལ་བའི་ཡང་དག་པའི་ལས་ཀྱི་མཐའ་བསྒོམ་པ་དང་། བདག་ལ་སྟོད་པ་དང་། གཞན་ལ་སྨོད་པ་དང་བྲལ་བའི་ཡང་དག་པའི་རྩོལ་བ་བསྒོམ་པ་དང་། གཏི་མུག་དང་རྨོངས་པ་དང་བྲལ་བའི་ཡང་དག་པའི་དྲན་པ་བསྒོམ་པ་དང་།
en: They cultivate (1) the right view, free from eternalism and nihilism; (2) right intention, free from notions of desire, ill will, and hostility; (3) right speech, which is neither harmful to oneself nor others; (4) right livelihood, free of pretense, flattery, hustling, and covetous evaluation; (5) right action, free of timidity of body and mind; (6) right effort, free of praising oneself and criticizing others; (7) right mindfulness, free of delusion and stupidity, and (8) right meditative absorption, free of all notions and concepts.

source: རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་དང་བྲལ་བའི་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་བསྒོམ་པ་སྟེ། འདི་ནི་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བསྒོམ་པ་ཞེས་བྱའོ། །
en: This is what is called cultivating the noble eightfold path.

source: དེས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་དང་། དེ་ལས་གཞན་པའི་དགེ་བ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་གང་ཡིན་པ་དག་ཀྱང་བག་ཡོད་པས་ཐོབ་ཅེས་བྱའོ། །
en: “This is why it is said that the awakening of buddha bhagavāns and all associated virtues will be achieved by those who are heedful in pursuing the thirty-seven factors for awakening.

source: གྲོགས་པོ་དག་དེ་ལྟར་ན་བག་ཡོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་པོ་འདི་དག་ལ་འཇུག་གོ །
en: So, friends, this is how heedful bodhisattvas engage in the thirty-seven factors for awakening.

source: ཞུགས་ནས་འདུ་བྱེད་ཐམས་ཅད་ཀྱི་འདམ་ལས་རྒལ་ལོ། །
en: By engaging in them, they pass beyond the mire of all karmic formations.

source: རྒལ་ནས་ཀྱང་རྣམ་པར་ལྟ་སྟེ།
en: Although they have crossed over, they look upon the world.

source: རྣམ་པར་བལྟས་ན་མི་མཐོང་ངོ་། །
en: But when they look, they do not see.

source: མི་འབར་རོ། །
en: They are not ignited.

source: ཤིན་ཏུ་ཉེ་བར་ཞི་སྟེ་རྣམ་པར་འཁྲུལ་བར་མི་བྱེད་དོ། །
en: Completely at peace, they make no errors.

source: ཤིན་ཏུ་ཉེ་བར་ཞི་བ་གང་ཞེ་ན།
en: What is it to be completely at peace?

source: གང་ཉེ་བར་མ་བསྒྲུབས་པ་དེ་མ་བྱས་པའོ། །
en: That which has not been achieved has not been done.

source: གང་མ་བྱས་པ་དེ་མྱོང་བ་མེད་པའོ། །
en: That which has not been done has not been experienced.

source: གང་མྱོང་བ་མེད་པ་དེ་ལ་གདགས་པ་མེད་དོ། །
en: That which has not been experienced is without designation.

source: གདགས་པ་མེད་པ་ནི་ཤིན་ཏུ་ཉེ་བར་ཞི་བའོ། །
en: And that which is without designation is completely at peace.”

source: བསྟན་པ་འདི་བཤད་པ་ན་ལྷའི་བུ་ཁྲི་ཉིས་སྟོང་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ །
en: When he gave this teaching, twelve thousand gods perfected the dustless dharma eye without stain.

source: ལྷའི་བུ་དཔལ་བཟངས་ཀྱིས་གཞན་ཡང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་ལམ་ཇི་ལྟར་སྒོམ།
en: The god Śrībhadra then asked Mañjuśrī Kumārabhūta, “Mañjuśrī, how do bodhisattvas cultivate the path?”

source: སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་འཁོར་བ་ཡང་མི་སྤོང་ལ། འཁོར་བའི་ཉེས་པ་རྣམས་ཀྱིས་ཀྱང་མི་གོས་སོ། །
en: Mañjuśrī replied, “Divine being, bodhisattvas do not abandon saṃsāra, nor are they sullied by the shortcomings of saṃsāra.

source: འདུས་མ་བྱས་སུ་ཡང་མི་ལྟུང་ལ། འདུས་མ་བྱས་ཀྱི་ཡོན་ཏན་རྣམས་ཀྱང་མྱོང་ངོ་། །
en: Though they do not fall into the unconditioned, they still experience the good qualities of the unconditioned.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་ལམ་ཡང་སྒོམ་ལ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཡུལ་ལ་ཡང་སྣང་ངོ་། །
en: Though they cultivate the path of the six perfections, the perceptual scopes of śrāvakas and pratyekabuddhas still appear.

source: ལྷའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ནི་སྟོང་པ་ཉིད་ཀྱིས་རྣམ་པར་དག་པ་ཡང་ཡིན་ལ། ལྟ་བར་གྱུར་པ་ལ་ཡང་མཁས་ཤིང་ལྟ་བར་གྱུར་པ་ལ་མངོན་པར་ཞེན་པ་ཡང་མེད་དོ། །
en: “Divine being, the bodhisattva path is perfected by emptiness, so although they are expert in views, they have no attachment to views.

source: མཚན་མ་མེད་པས་རྣམ་པར་དག་པ་ཡང་ཡིན་ལ། མཚན་མ་ལ་ཡང་མཁས་ཤིང་མཚན་མ་ལ་མངོན་པར་ཞེན་པ་ཡང་མེད་དོ། །
en: The path is perfected by signlessness, so although they are expert in signs, they have no attachment to signs.

source: སྨོན་པ་མེད་པས་རྣམ་པར་དག་པ་ཡང་ཡིན་ལ། ཁམས་གསུམ་པ་ལ་ཡང་མཁས་ཤིང་ཁམས་གསུམ་པ་ལ་མངོན་པར་ཞེན་པ་ཡང་མེད་དོ། །
en: The path is perfected by wishlessness, so although they are expert in the three realms, they have no attachment to the three realms.

source: སྐྱེ་བ་མེད་པ་དང་། འབྱུང་བ་མེད་པས་རྣམ་པར་དག་པ་ཡང་ཡིན་ལ། སྐྱེ་བ་དང་འཇིག་པ་ལ་ཡང་མཁས་ཤིང་སྐྱེ་བ་དང་འཇིག་པ་ལ་མངོན་པར་ཞེན་པ་ཡང་མེད་དོ། །
en: The path is perfected by birthlessness and nonarising, so although they are expert in arising and cessation, they have no attachment to arising and cessation.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་ངེས་པར་སེམས་པ་རྣམས་ནི་སེམས་ཅན་ཆོས་ཐམས་ཅད་སྟོང་པའོ་སྙམ་པའི་ལྟ་བར་གྱུར་པར་ཞུགས་པ།
en: Because bodhisattvas with certainty of mind engage the view that considers all beings and all phenomena as empty.

source: ལྟ་བར་གྱུར་པ་བག་ལ་ཉལ་བར་བྱས་པ་རྣམས་ཀྱི་ལྟ་བར་གྱུར་པ་སྤང་བའི་ཕྱིར་ཆོས་ཀྱང་སྟོན་ལ། ལྟ་བར་གྱུར་པ་དེ་དག་ཀྱང་སྟོང་པ་ཉིད་དུ་མཐོང་ངོ་། །དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: In order to dispense with views that create latent propensities and perpetuate views, they teach the Dharma, while seeing all views as empty.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་ངེས་པར་སེམས་པ་ནི་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འབྱུང་བ་མེད་པའི་ཆོས་ཐམས་ཅད་ལ་འབྱུང་བ་དང་འཇིག་པའི་རྗེས་སུ་འཐུན་པ།
en: In the same way, bodhisattvas with certainty of mind abandon conformity to the framework of arising and cessation with regard to all phenomena—such that they are signless, wishless, devoid of karmic formations, unborn, and unarisen—as well as the view of arising and cessation that creates the propensity for the notion of arising and cessation.

source: འབྱུང་བ་དང་འཇིག་པ་བག་ལ་ཉལ་བར་བྱས་པ་རྣམས་ཀྱི་འབྱུང་བ་དང་འཇིག་པར་ལྟ་བ་སྤང་བའི་ཕྱིར་ཆོས་ཀྱང་སྟོན་ལ། འབྱུང་བ་དང་འཇིག་པ་དེ་ཡང་འབྱུང་བ་དང་འཇིག་པ་མེད་པ་ཉིད་དུ་མཐོང་སྟེ།
en: In order to do so, they teach the Dharma even though they see arising and cessation as devoid of arising and cessation.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་སྒོམ་པ་ཞེས་བྱའོ། །
en: This is called cultivating the path of bodhisattvas.

source: ལྷའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ནི་འགྲོ་བ་དང་འོང་བ་ཞེས་བྱའོ། །
en: “Divine being, furthermore, on the path of bodhisattvas there are what are called going and coming.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འགྲོ་བ་ནི་སེམས་ཅན་གྱི་བསམ་པ་རྣམས་ལའོ། །
en: The going of bodhisattvas refers to how they reach out to the thoughts of sentient beings.

source: འོང་བ་ནི་སོ་སོ་ཅི་རིགས་པར་ཆོས་སྟོན་པའི་ཕྱིར་རོ། །
en: The coming refers to their teaching the Dharma appropriately to each individual.

source: བྱང་ཆུབ་སེམས་དཔའི་འགྲོ་བ་ནི་སྙོམས་པར་འཇུག་པ་སྐྱེད་པའི་ཕྱིར་རོ། །
en: The going of bodhisattvas refers to their giving rise to meditative equipoise.

source: འོང་བ་ནི་འདོད་པའི་ཁམས་ཀྱི་སེམས་ཅན་གྱི་ནང་དུ་སྐྱེ་བའི་ཕྱིར་རོ། །
en: The coming refers to their being born among sentient beings of the desire realm.

source: བྱང་ཆུབ་སེམས་དཔའི་འགྲོ་བ་ནི་འཕགས་པའི་ལམ་དུའོ། །
en: The going of bodhisattvas refers to their progress on the noble path.

source: འོང་བ་ནི་འཕགས་པ་མ་ཡིན་པའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཕྱིར་རོ། །
en: The coming refers to their bringing sentient beings who are not noble ones to full ripening.

source: འགྲོ་བ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ། །འོང་བ་ནི་བཟོད་པ་དེ་སེམས་ཅན་གྱི་ཁོང་དུ་ཆུད་པར་བྱེད་པའི་ཕྱིར་རོ། །
en: Going refers to their attainment of forbearance toward phenomena as unborn, and coming refers to making other sentient beings understand that acceptance.

source: བྱང་ཆུབ་སེམས་དཔའི་འགྲོ་བ་ནི་འབྱུང་བ་ལ་མཁས་པ་ལའོ། །འོང་བ་ནི་འབྱུང་བ་མ་ཡིན་པར་འབྱུང་བའི་ཕྱིར་རོ། །
en: The going of bodhisattvas refers to their expertise in arising, and coming refers to arising as nonarising.

source: བྱང་ཆུབ་སེམས་དཔའི་འགྲོ་བ་ནི་མྱ་ངན་ལས་འདས་པར་འགྲོ་བའི་ཕྱིར་རོ། །འོང་བ་ནི་འཁོར་བ་ན་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཕྱིར་རོ། །
en: The going of bodhisattvas refers to their passing into nirvāṇa, and coming refers to bringing sentient beings to full ripening in saṃsāra.

source: འགྲོ་བ་ནི་གང་དུ་ཡང་འགྲོ་བ་དང་། འོང་བ་མེད་པར་སོ་སོར་རྟོག་པའི་ཕྱིར་རོ། །
en: Going refers to the discernment that there is neither going nor coming anywhere.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འོང་བ་ནི་ཆོས་ཁོང་དུ་ཆུད་པར་བྱེད་པའི་ཕྱིར་རོ། །
en: The coming of bodhisattvas refers to making the Dharma understood.

source: འགྲོ་བ་ནི་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་བསྒོམ་པའི་ཕྱིར་རོ། །
en: Going refers to meditation on the doors of liberation: emptiness, signlessness, and wishlessness.

source: འོང་བ་ནི་རྣམ་པར་རྟོག་པ་གསུམ་སྤང་བར་ཆོས་སྟོན་པའི་ཕྱིར་རོ། །
en: Coming refers to teaching the Dharma while abandoning the three conceptualizations.

source: འགྲོ་བ་ནི་དམ་བཅས་པ་བརྟན་པར་བྱེད་པའི་ཕྱིར་རོ། །
en: Going refers to making their commitments stable.

source: འོང་བ་ནི་དམ་བཅས་པ་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པའི་ཕྱིར་རོ། །
en: Coming refers to ensuring commitments are grounded in experience.

source: བྱང་ཆུབ་སེམས་དཔའི་འགྲོ་བ་ནི་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བའི་ཕྱིར་རོ། །
en: The going of bodhisattvas refers to proceeding toward the seat of awakening.

source: བྱང་ཆུབ་སེམས་དཔའི་འོང་བ་ནི་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པའི་ཕྱིར་ཏེ།
en: The coming of bodhisattvas refers to acting with awakened conduct.

source: ལྷའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་འགྲོ་བ་དང་འོང་བ་ཞེས་བྱའོ། །
en: Divine being, these are called the goings and comings on the path of bodhisattvas.”

source: བསྟན་པ་འདི་བཤད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ། །
en: When this teaching was given, five hundred bodhisattvas reached forbearance toward phenomena as unborn.

source: དེ་ནས་ལྷའི་བུ་དཔལ་བཟངས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་བདག་གིས་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཅེས་བགྱི་བ་ཞིག་ཐོས་ན་འཇམ་དཔལ་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་དེ་ཕྱོགས་གང་ན་མཆིས།
en: Then the god Śrībhadra said to Mañjuśrī Kumārabhūta, “Mañjuśrī, I have heard of a world called Light of All Good Qualities.

source: དེ་ན་དེ་བཞིན་གཤེགས་པའི་མཚན་ཇི་སྐད་ཅེས་བགྱི་བ་ཞིག་ཆོས་སྟོན།
en: Mañjuśrī, in what direction is the world Light of All Good Qualities, and what is the name of the tathāgata who teaches the Dharma there?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་སྟེང་གི་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཅུ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཅེས་བྱ་བ་ཡོད་དེ།
en: Mañjuśrī replied, “Divine being, the world called Light of All Good Qualities is in the upward direction from this buddhafield; it is many buddhafields away, as many as the grains of sand along the banks of twelve Ganges Rivers.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་བཟང་པོ་ཞེས་བྱ་བ་ཆོས་སྟོན་ཏོ། །
en: There, the tathāgata, arhat, completely perfect buddha known as Samantabhadra teaches the Dharma.”

source: སྨྲས་པ། འཇམ་དཔལ་བདག་གིས་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་དེ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་བཟང་པོ་དེ་བལྟ་བར་བགྱིའོ། །
en: The god Śrībhadra said, “Mañjuśrī, let me see that world called Light of All Good Qualities and the tathāgata, arhat, completely perfect Buddha Samantabhadra!”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དེའི་ཚེ་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: whereupon Mañjuśrī Kumārabhūta entered the meditative absorption known as stainless light.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་ལུས་ལས་དེ་དང་འཐུན་པའི་འོད་བྱུང་སྟེ།
en: As soon as Mañjuśrī Kumārabhūta was absorbed in that meditation, light, as befits that absorption, shone from his body, and that light illuminated buddhafields as numerous as the grains of sand along the banks of twelve Ganges Rivers.

source: འོད་དེས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཅུ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་པོ་དེ་དག་སྣང་བར་བྱས་ནས་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་དེ་ཡང་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །
en: That great light even reached the world Light of All Good Qualities.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་བཟང་པོ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་སྐྱེས་པ་དེ་དག་གིས་འོད་དེ་མཐོང་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: The bodhisattvas born in that buddhafield of the bhagavān tathāgata Samantabhadra saw that light and were amazed.

source: ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཅོམ་ལྡན་འདས་འོད་འདི་ལྟར་ཡོངས་སུ་དག་པ་འདི་གང་ནས་མཆིས། བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ།
en: Joining their hands in supplication, they inquired of the bhagavān, “Bhagavān, whence comes pure light such as this?”

source: རིགས་ཀྱི་བུ་དག་འོག་གི་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཅུ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་འདས་པ་ན།
en: The bhagavān replied, “O heirs of the lineage, it comes from below, from many buddhafields away, as many as the grains of sand along the banks of twelve Ganges Rivers.

source: འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ། དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་བཞུགས་སོ། །འཚོ་འོ། །
en: That world is called Sahā, and there lives a tathāgata, arhat, completely perfect buddha called Śākyamuni.

source: གཞེས་སོ། །ཆོས་ཀྱང་སྟོན་ཏོ། །
en: There he abides, receives offerings, and teaches the Dharma.

source: དེ་ན་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཞེས་བྱ་བ་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ།
en: There, the irreversible bodhisattva known as Mañjuśrī Kumārabhūta is settled in the meditative absorption known as stainless light.

source: དེའི་ལུས་ཀྱི་འོད་ཀྱིས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་གྲངས་མེད་པ་དག་སྣང་བ་ཆེན་པོས་ཁྱབ་བོ། །
en: The vast light emitted from his body has spread over the infinite and countless buddhafields of the ten directions.

source: དེས་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་སྣང་བ་ཆེན་པོས་ཁྱབ་བོ། །
en: That vast light even illuminates this world.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བལྟ་བར་བགྱིའོ། །
en: “Bhagavān,” they said, “let us see this Sahā world, and the bhagavān tathāgata Śākyamuni, and Mañjuśrī Kumārabhūta!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་བཟང་པོས་ཞབས་ཀྱི་འོག་གི་མཐིལ་གྱི་འཁོར་ལོ་རྩིབས་སྟོང་དང་ལྡན་པ་ལས་འོད་ཟེར་སྟོང་བྱུང་སྟེ།
en: So the bhagavān tathāgata Samantabhadra sent out a thousand rays of light from the thousand spokes of the wheel on the sole of one of his feet.

source: འོད་ཟེར་དེ་དག་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཅུ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་ལས་འདས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་བྱས་སོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་མཐོང་ཞིང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་།
en: Those great rays crossed buddhafields as numerous as the grains of sand along the banks of twelve Ganges Rivers and illuminated the Sahā world, and the bodhisattvas saw the Sahā world, and the bhagavān, tathāgata, arhat, truly perfect Buddha Śākyamuni, and Mañjuśrī Kumārabhūta, and the entire assembly of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ཀྱང་མཐོང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གིས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་དེ་མཐོང་ཞིང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་བཟང་པོ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་མཐོང་ངོ་། །
en: The bodhisattvas there likewise saw the world Light of All Good Qualities, along with the bhagavān, tathāgata, arhat, truly perfect Buddha Samantabhadra, and all the bodhisattvas there.
